_posts/2013-10-06-hello-world.html
---
layout: post
title:  "Hello World!"
---
<script type="text/javascript">
/*
@licstart  The following is the entire license notice for the
JavaScript code in this tag.

Copyright (C) 2012  Free Software Foundation, Inc.

The JavaScript code in this tag is free software: you can
redistribute it and/or modify it under the terms of the GNU
General Public License (GNU GPL) as published by the Free Software
Foundation, either version 3 of the License, or (at your option)
any later version.  The code is distributed WITHOUT ANY WARRANTY;
without even the implied warranty of MERCHANTABILITY or FITNESS
FOR A PARTICULAR PURPOSE.  See the GNU GPL for more details.

As additional permission under GNU GPL version 3 section 7, you
may distribute non-source (e.g., minimized or compacted) forms of
that code without the copy of the GNU GPL normally required by
section 4, provided you include this license notice and a URL
through which recipients can access the Corresponding Source.


@licend  The above is the entire license notice
for the JavaScript code in this tag.
*/
<!--/*--><![CDATA[/*><!--*/
 function CodeHighlightOn(elem, id)
 {
   var target = document.getElementById(id);
   if(null != target) {
     elem.cacheClassElem = elem.className;
     elem.cacheClassTarget = target.className;
     target.className = "code-highlighted";
     elem.className   = "code-highlighted";
   }
 }
 function CodeHighlightOff(elem, id)
 {
   var target = document.getElementById(id);
   if(elem.cacheClassElem)
     elem.className = elem.cacheClassElem;
   if(elem.cacheClassTarget)
     target.className = elem.cacheClassTarget;
 }
/*]]>*///-->
</script><div id="table-of-contents">
<h3>Inhaltsverzeichnis</h3>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Begrüßung</a>
<ul>
<li><a href="#sec-1-1">1.1. Zu meiner Person</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Programmierung der Homepage</a>
<ul>
<li><a href="#sec-2-1">2.1. Jekyll</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Statische Homepages</a></li>
<li><a href="#sec-2-1-2">2.1.2. GitHub</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Emacs</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Org Mode</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Das Shellscript</a></li>
</ul>
</li>
</ul>
</div><p></p>
</div><p></p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Begrüßung</h2>
<div class="outline-text-2" id="text-1">
<p>
Hallo, dies ist mein erster Post hier. Ich bin gespannt, ob ich mich für das Bloggen begeistern kann. Gleichzeitig dient diese Homepage dazu, gemeinschaftlich über Probleme nachzudenken. Diese können aus ganz verschiedenen Bereichen kommen. Hier im Speziellen wird es sich um Themen der Musikpädagogik, der Empirie, des Computers und der Typography drehen.
</p>
</div><p></p>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Zu meiner Person</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Ich bin derzeit Student der Schul- und Kirchenmusik und der Physik. Ich plane nach dem Studium einen Doktor in empirischer Musikpädagogik zu machen und beschäftige mich deswegen nun seit ein paar Wochen mit dem Programmieren. 
</p>

<p>
Angefangen habe ich mit Python; als pädagogische Programmiersprache erschien mir dies besonders Sinnvoll in anbetracht meiner mangelnden Erfahrung. Nach ein paar ersten Progrämmchen verlor ich ein wenig die Motivation aufgrund von fehlenden Problemstellungen.
</p>

<p>
Dann bin ich auf die Lernplattform <a href="http://www.edx.org">EdX</a> gestoßen. Diese bietet kostenlose MOOCs an, also Vorlesungen (meist vom MIT oder Harvard), die den regulären Studenten auch angeboten werden. Dort bin ich nun in CS50 eingeschrieben und besuche regelmäßig Vorlesungen zum Programmieren und bearbeite auch die dortigen Aufgaben. So bin ich erst zu C und dann zu PHP gekommen.
</p>
</div><p></p>
</div><p></p>
</div><p></p>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Programmierung der Homepage</h2>
<div class="outline-text-2" id="text-2">
<p>
Die Grundlagen dieser durch <a href="http://www.jekyllrb.com">Jekyll</a> compilierten Homepage haben mich einige Tage gekostet, da ich noch kaum Erfahrung mit Markup-Sprachen hatte. Ferner wollte ich einige Prozesse automatisieren und verbessern, was mir manch einen Nerv geraubt hat.
</p>
</div><p></p>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Jekyll</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Jekyll ist ein statischer Homepage generierer der vor allem bei Programmieren sehr beliebt ist. Dies liegt an Verschiedenem.
</p>
</div><p></p>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Statische Homepages</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Der große Vorteil an statischen Homepages ist, dass diese keine Datenbank wie MySQL benötigen. Zudem benötigen sie kein PHP und sind somit nicht nur sehr sicher, sondern auch auf jedem Web-Server funktionsfähig. Weiterhin sind statische Homepages sehr performant.
</p>
</div><p></p>
</div><p></p>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> GitHub</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Ein weiterer fantastischer Vorteil 0ist, dass die Open-Soure-Entwicklungsplattform <a href="http://www.github.com">GitHub</a> Jekyll-Seiten kostenlos ohne Werbung publizieren lässt. So ist diese Seite kostenfrei unter <a href="https://knupfer.github.io">https://knupfer.github.io</a> gehostet. Dieser Service ist aber nicht alles, GitHub kompiliert für einen sogar den Sourcecode der Homepage. Jedoch gibt es hier auch kleine Einschränkungen, so werden zusätzliche Plugins beispielsweise aus Sicherheitsgründen nicht unterstützt.
</p>
</div><p></p>
</div><p></p>
</div><p></p>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Emacs</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Emacs ist wohl einer der ältesten und umfangreichesten Texteditoren. Dass ein Texteditor umfangreich oder gar komplex sein kann, mag zunächst überraschen, jedoch kann Emacs äußerst erstaunlich Dinge:
</p>
<ul class="org-ul">
<li>Programmcode kann im Editor kompiliert werden
</li>
<li>Syntaxhighlighting
</li>
<li>Verschiedene Themes
</li>
<li>Sehr starke und umfangreiche Navigationswerkzeuge, z. B.:
<ul class="org-ul">
<li>Cursorbewegung durch Shortcuts
</li>
<li>Löschen von Buchstaben, Wörtern oder ganzen Absätzen
</li>
<li>Wechseln von verschiedenen Fenstern per Shortcut
</li>
<li>Fenstersplitting usw.
</li>
</ul>
</li>
<li>Durch seine Programmierbarkeit starke Erweiterbarkeit:
<ul class="org-ul">
<li>kann der Editor direkt als Taschenrechner verwendet werden
</li>
<li>gibt viele IDE, die für Emacs von der Community programmiert wurden
</li>
</ul>
</li>
</ul>
</div><p></p>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Org Mode</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<a href="http://www.orgmode.org">Org Mode</a> ist eine von vielen möglichen Erweiterungen von Emacs, die selbst so umfangreich ist, dass die Dokumentation ein sehr dickes Buch füllt. Mit Org Mode kann man, wie der Name bereits sugeriert, sich organisieren. Dies fängt von ganz simplen Aufgaben wie Todo-Listen an, geht weiter zu einem sehr guten Outliner und auch zu mehrsprachigem (Computersprachen) literateprogramming.
</p>
</div><p></p>

<ol class="org-ol"><li>Exportfunktionen<br  /><div class="outline-text-5" id="text-2-2-1-1">
<p>
Eine große Stärke von Org Mode sind die Exportfunktionen. Es kann u. a. nach LaTeX, Html, Docbook und Ascii exportiert werden. Dieses Feature ist so sehr ausgereift, dass die resultierenden Dokumente oft sehr gut aussehen. Automatisch wird ein Inhaltsverzeichnis generiert, ausgezeichnet, ggf. code compiliert uvm. Aller Text dieser Homepage ist ausschließlich in Org Mode verfasst, in ein Html exportiert und danach mit einem Shellscript den Anforderungen von Jekyll angepasst.
</p>
</div><p></p>
</li>
<li>Syntaxhighlighting<br  /><div class="outline-text-5" id="text-2-2-1-2">
<p>
Der Export von Syntaxhighlighting von Html ist ein wenig aufwendig. Man könnte zwar auf das Syntaxhighlighting von Jekyll zurückgreifen, dies ist aber für helle Codeboxen optimiert, was nicht meiner Designvorstellung entsprach. Eine Änderung dieses Highlightings würde mit mühevollem ändern und testen jedes einzelnen Codeschlüsselwortes in einer css-Datei einhergehen, worauf ich keine Lust habe, da es auch möglich ist, dass diese Homepage ihr Äußeres noch mehrfach verändert etc.
</p>

<p>
Mithilfe des Zusatzpakete htmlize.el für Emacs ist es mir gelungen, Emacs so einzurichten, dass er automatisch das gleiche Syntaxhighlighting, welches derzeit im Editor aktiv ist, in den Html-export übernimmt. Über ein in Org Mode implementiertes Javascript ist es sogar möglich, über links Referenzcodezeilen zu manipulieren. Die Standardeinstellung war, die ganze Zeile gelb zu färben, was sehr direkt war. Ich habe mich für eine dezente Version entschieden und habe den Sourcecode so geändert, dass wenn der Cursor über dem link ist, die entsprechende Codezeile fett dargestellt wird.
</p>
</div><p></p>
</li></ol>
</div><p></p>
</div><p></p>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Das Shellscript</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Da Jekyll einen speziellen Head einer Html-Datei benötigt, blieb mir nichts anderes übrig, diesen Anfang über ein Shellscript in das durch Emacs exportierte Html einzufügen. Ich habe Emacs so konfiguriert, dass es nur den Body der Html exportiert und habe das Javascript für das Syntaxhighlighting seperat abgespeichert. In dem Shellscript wird der <a href="#coderef-head"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-head');" onmouseout="CodeHighlightOff(this, 'coderef-head');">Head</a> aus der .org-Datei flexibel extrahiert und in einer neuen Datei abgespeichert, daraufhin das <a href="#coderef-java"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-java');" onmouseout="CodeHighlightOff(this, 'coderef-java');">Javascript</a> eingefügt und dann der Html-Body. Zum Schluss wird noch die Datei umbenannt und in den von Jekyll verabeiteten _posts-Ordner <a href="#coderef-move"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-move');" onmouseout="CodeHighlightOff(this, 'coderef-move');">verschoben</a>. Das Skript macht diese Prozedur automatisch, <a href="#coderef-for"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-for');" onmouseout="CodeHighlightOff(this, 'coderef-for');">mit allen .org-Dateien</a>, die exportiert wurden, sprich die verändert wurden. Bereits aktuelle Posts werden nicht modifiziert, so bleibt das Datum des Posts erhalten.
</p>

<p>
Hier zum nachlesen und nachdenken das Shellscript, natürlich mit Syntaxhighlighting usw.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">!/bin/</span><span style="color: #00bfff;">sh</span>

<span id="coderef-for" class="coderef-off"><span style="color: #00bfff;">for</span> file<span style="color: #00bfff;"> in</span> *.org</span>
<span style="color: #00bfff;">do</span>
    <span style="color: #4eee94;">DATEI</span>=$(<span style="color: #fa8072;">echo</span> $<span style="color: #4eee94;">file</span> | sed <span style="color: #deb887;">'s/\(.*\).org/\1/'</span>) ;
    <span style="color: #f08080;">test</span> -e $<span style="color: #4eee94;">DATEI</span>.html &amp;&amp;
<span id="coderef-head" class="coderef-off">    grep -B 20 -m 1 END $<span style="color: #4eee94;">DATEI</span>.org | head -n -1 |</span>
  tail -n +2 &gt; $<span style="color: #4eee94;">DATEI</span>.org.publish &amp;&amp;
<span id="coderef-java" class="coderef-off">    cat _script &gt;&gt; $<span style="color: #4eee94;">DATEI</span>.org.publish &amp;&amp;</span>
    sed <span style="color: #deb887;">'N; s/&lt;\/ul&gt;\n&lt;\/div&gt;/&amp;&lt;p&gt;&lt;\/p&gt;/; P; </span>
<span style="color: #deb887;">  s/&lt;h2&gt;Table of Contents&lt;\/h2&gt;/&lt;h3&gt;Inhaltsverzeichnis&lt;\/h3&gt;/; D'</span>
  $<span style="color: #4eee94;">DATEI</span>.html &gt;&gt; $<span style="color: #4eee94;">DATEI</span>.org.publish &amp;&amp;
<span id="coderef-move" class="coderef-off">    cat $<span style="color: #4eee94;">DATEI</span>.org.publish &gt; ../_posts/$<span style="color: #4eee94;">DATEI</span>.html &amp;&amp;</span>
    rm $<span style="color: #4eee94;">DATEI</span>.html $<span style="color: #4eee94;">DATEI</span>.org.publish;
<span style="color: #00bfff;">done</span>;
</pre>
</div><p></p>
</div><p></p>
</div><p></p>
</div><p></p>
